In [1]:
import pandas as pd

df_raw = pd.DataFrame({
    'var1' : [1,2,3],
    'var2' : [2,3,2]
})

df_raw

   var1  var2
0     1     2
1     2     3
2     3     2

In [2]:
df_new = df_raw.copy()
df_new

   var1  var2
0     1     2
1     2     3
2     3     2

In [3]:
df_new = df_new.rename(columns={'var2':'v2'})
df_new

   var1  v2
0     1   2
1     2   3
2     3   2

In [4]:
df = pd.DataFrame({
    'var1' : [1,2,3],
    'var2' : [2,3,2]
})

df['var_sum'] = df['var1']+df['var2']
df

   var1  var2  var_sum
0     1     2        3
1     2     3        5
2     3     2        5

In [6]:
df['var_mean'] = (df['var1'] + df['var2']) / 2
df

   var1  var2  var_sum  var_eamn  var_mean
0     1     2        3       1.5       1.5
1     2     3        5       2.5       2.5
2     3     2        5       2.5       2.5

In [10]:
df

   var1  var2  var_sum  var_mean
0     1     2        3       1.5
1     2     3        5       2.5
2     3     2        5       2.5